Documents/ТранзакцииВыч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ТранзакцииВыч</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПереводов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Указать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыПереводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТипыПереводов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДругомуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Игры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Такси</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Косметика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаМашину</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КафеРесторан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БытТехника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Одежда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятияНаличных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ТранзакцииВыч/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Дата = ТекущаяДата();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТипТранзакции = ТекущийОбъект.Тип;
	ОбъектТекущийСчет  = ТекущийОбъект.Счет.ПолучитьОбъект();
	БалансСчета = ОбъектТекущийСчет.Сумма;
	СуммаТранзакции  = ТекущийОбъект.Сумма;
	
	Если БалансСчета < СуммаТранзакции Тогда
		Сообщить("Недостаточно средств, проверьте ваш счет");
	Иначе
		БалансСчета = БалансСчета - СуммаТранзакции;
		ОбъектТекущийСчет.Сумма = БалансСчета;
		ОбъектТекущийСчет.Записать();
	КонецЕсли
КонецПроцедуры 

&НаКлиенте
Процедура ТипОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)  
	ТипДругомуЛицу = ПредопределенноеЗначение("Перечисление.ТипыПереводов.ДругомуЛицу");
	ТипДругое = ПредопределенноеЗначение("Перечисление.ТипыПереводов.Другое");	
	Если Объект.Тип = ТипДругомуЛицу Тогда
		ЭтаФорма.Элементы.НомерТелефона.Видимость = True;
	Иначе 
		ЭтаФорма.Элементы.НомерТелефона.Видимость = False;
	КонецЕсли;
	
	Если Объект.Тип = ТипДругое Тогда
		ЭтаФорма.Элементы.Указать.Видимость = True;
	Иначе 
		ЭтаФорма.Элементы.Указать.Видимость = False;
	КонецЕсли;
КонецПроцедуры
